Repository: tidestoday/tides-wp-plugin
Catalog: languages/tides-today-*.po
Languages: cy

source: Tide times
cy: Amserau llanw

source: Location '%s' was not found
cy: Lleoliad '%s' heb ei darganfod

source: Tide Times
cy: Amserau llanw

source: Display tide times for over 700 UK and Ireland locations.
cy: Amseroedd y llanw arddangos ar gyfer dros 700 o leoliadau yn y DU ac Iwerddon.

source: Title
cy: Teitl

source: Enter a title to display
cy: Rhowch deitl i arddangos

source: Tide times for...
cy: Amserau llanw ar gyfer...

source: Description
cy: Disgrifiad

source: Enter a description to display
cy: Rhowch ddisgrifiad i arddangos

source: Days to show
cy: Diwrnod i ddangos

source: Choose how many days to show
cy: Dewiswch sawl diwrnod i ddangos

source: 1 day
cy: 1 diwrnod

source: 2 days
cy: 2 ddiwrnod

source: 3 days
cy: 3 diwrnod

source: Display location map?
cy: Dangos map lleoliad?

source: Choose to show a map or not
cy: Dewis i ddangos map neu beidio

source: Yes
cy: Iawn

source: No
cy: Na

source: Locations
cy: Lleoliadau

source: Choose which location to show tides for
cy: Dewis pa leoliad i ddangos llanw ar gyfer

source: Tides Today UK and Ireland Tide Times
cy: Mae'r ategyn llanw heddiw DU ac Iwerddon gynorthwyo gwaith yn rhoi'r rhagolygon llanw 3 diwrnod ar gyfer dros 700 o leoliadau y DU ac Iwerddon.

source: The Tides Today UK and Ireland Tide Times plugin provides 3 day tide forecasts for over 700 UK and Ireland locations.
cy: Mae'r ategyn llanw heddiw DU ac Iwerddon gynorthwyo gwaith yn rhoi'r rhagolygon llanw 3 diwrnod ar gyfer dros 700 o leoliadau y DU ac Iwerddon.
